Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_eth_type.h
/**************************************************************************//**
 * @file    rtl8735b_ethernet_type.h
 * @brief    The register definitions of Ethernet MAC controller.
 * @version V1.00
 * @date    2017-07-20
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef _RTL8735B_ETHERNET_TYPE_H_
#define _RTL8735B_ETHERNET_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_ETHERNET_REG_TYPE

/**
 * @addtogroup hs_hal_ethernet_reg ETHERNET Registers.
 * @ingroup hs_hal_ethernet
 * @{
 */

/**
  \brief Union type to access ethernet_idr0 (@ 0x00000000).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000000) MAC ID Register 1                                          */

	struct {
		__IOM uint32_t idr3       : 8;            /*!< [7..0] 4th byte of MAC ID                                                 */
		__IOM uint32_t idr2       : 8;            /*!< [15..8] 3rd byte of MAC ID                                                */
		__IOM uint32_t idr1       : 8;            /*!< [23..16] 2nd byte of MAC ID                                               */
		__IOM uint32_t idr0       : 8;            /*!< [31..24] 1st byte of MAC ID                                               */
	} b;                                        /*!< bit fields for ethernet_idr0 */
} ethernet_idr0_t, *pethernet_idr0_t;

/**
  \brief Union type to access ethernet_idr4 (@ 0x00000004).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000004) MAC ID Register 2                                          */

	struct {
		__IM  uint32_t            : 16;
		__IOM uint32_t idr5       : 8;            /*!< [23..16] 6th byte of MAC ID                                               */
		__IOM uint32_t idr4       : 8;            /*!< [31..24] 5th byte of MAC ID                                               */
	} b;                                        /*!< bit fields for ethernet_idr4 */
} ethernet_idr4_t, *pethernet_idr4_t;

/**
  \brief Union type to access ethernet_txok_rxok (@ 0x00000010).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000010) TxRx Ok Counter Register                                   */

	struct {
		__IOM uint32_t rxok       : 16;           /*!< [15..0] 16-bit counter of Rx Ok packets. Rolls over automatically.
                                                   Write to clear.                                                           */
		__IOM uint32_t txok       : 16;           /*!< [31..16] 16-bit counter of Tx Ok packets. Rolls over automatically.
                                                   Write to clear.                                                           */
	} b;                                        /*!< bit fields for ethernet_txok_rxok */
} ethernet_txok_rxok_t, *pethernet_txok_rxok_t;

/**
  \brief Union type to access ethernet_txerr_rxerr (@ 0x00000014).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000014) TxRx Error Counter Register                                */

	struct {
		__IOM uint32_t rxerr      : 16;           /*!< [15..0] 16-bit counter of Rx error packets. Rolls over automatically.
                                                   Write to clear.                                                           */
		__IOM uint32_t txerr      : 16;           /*!< [31..16] 16-bit counter of Tx error packets. Rolls over automatically.
                                                   Write to clear.                                                           */
	} b;                                        /*!< bit fields for ethernet_txerr_rxerr */
} ethernet_txerr_rxerr_t, *pethernet_txerr_rxerr_t;

/**
  \brief Union type to access ethernet_com (@ 0x00000038).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000038) Command Register                                           */

	struct {
		__IOM uint32_t rst        : 1;            /*!< [0..0] Reset: Setting to 1 forces the Ethernet module to a software
                                                   reset state which disables the transmitter and receiver,
                                                   reinitializes the FIFOs, triggers interrupt Swint for RISC
                                                   to reset the system buffer pointer to the initial value
                                                   Tx/Rx FDP. This bit is 1 during the reset operation, and
                                                   is cleared to 0 by the Ethernet Module when the reset operation
                                                   is complete.                                                              */
		__IOM uint32_t rxchksum   : 1;            /*!< [1..1] Receive checksum offload enable. 1: Enable. 0: Disable.            */
		__IOM uint32_t rxvlan     : 1;            /*!< [2..2] Receive VLAN de-tagging enable. 1: Enable. 0: Disable.             */
		__IOM uint32_t rxjumbo    : 1;            /*!< [3..3] 1: support jumbo packet receiving. The maximum packet
                                                   size is 16384 Bytes (0x4000). 0: Does not support jumbo
                                                   packet receiving.                                                         */
	} b;                                        /*!< bit fields for ethernet_com */
} ethernet_com_t, *pethernet_com_t;

/**
  \brief Union type to access ethernet_isr_imr (@ 0x0000003C).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x0000003C) Interrupt Status & Interrupt Mask Register                 */

