Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_eth_type.h
	struct {
		__IOM uint32_t isr_rok    : 1;            /*!< [0..0] Interrupt status of Rx ok. Write 1 to clear                        */
		__IOM uint32_t isr_cnt_wrap : 1;          /*!< [1..1] Interrupt status of Tx/Rx counter wrap interrupt. Write
                                                   1 to clear                                                                */
		__IOM uint32_t isr_rer_runt : 1;          /*!< [2..2] Interrupt status of Rx error caused by runt error characterized
                                                   by the frame length in bytes being less than 64 bytes.
                                                   Write 1 to clear                                                          */
		__IM  uint32_t            : 1;
		__IOM uint32_t isr_rer_ovf : 1;           /*!< [4..4] Interrupt status of Rx FIFO overflow. Write 1 to clear             */
		__IOM uint32_t isr_rdu    : 1;            /*!< [5..5] Interrupt status of Rx descriptor ring1 is unavailable.
                                                   Write 1 to clear                                                          */
		__IOM uint32_t isr_tok    : 1;            /*!< [6..6] Interrupt status of Tx ok. Write 1 to clear                        */
		__IOM uint32_t isr_ter    : 1;            /*!< [7..7] Interrupt status of Tx error. Write 1 to clear                     */
		__IOM uint32_t isr_linkchg : 1;           /*!< [8..8] Interrupt status of link change. Write 1 to clear                  */
		__IOM uint32_t isr_tdu    : 1;            /*!< [9..9] Interrupt status of Tx descriptor ring1 is unavailable.
                                                   Write 1 to clear                                                          */
		__IOM uint32_t isr_swint  : 1;            /*!< [10..10] Interrupt status of software interrupt pending. Write
                                                   1 to clear                                                                */
		__IOM uint32_t isr_rdu2   : 1;            /*!< [11..11] Interrupt status of Rx descriptor ring2 is unavailable.
                                                   Write 1 to clear                                                          */
		__IOM uint32_t isr_rdu3   : 1;            /*!< [12..12] Interrupt status of Rx descriptor ring3 is unavailable.
                                                   Write 1 to clear                                                          */
		__IOM uint32_t isr_rdu4   : 1;            /*!< [13..13] Interrupt status of Rx descriptor ring4 is unavailable.
                                                   Write 1 to clear                                                          */
		__IOM uint32_t isr_rdu5   : 1;            /*!< [14..14] Interrupt status of Rx descriptor ring5 is unavailable.
                                                   Write 1 to clear                                                          */
		__IOM uint32_t isr_rdu6   : 1;            /*!< [15..15] Interrupt status of Rx descriptor ring6 is unavailable.
                                                   Write 1 to clear                                                          */
		__IOM uint32_t imr_rok    : 1;            /*!< [16..16] Interrupt mask of Rx ok                                          */
		__IOM uint32_t imr_cnt_wrap : 1;          /*!< [17..17] Interrupt mask of Tx/Rx counter wrap interrupt                   */
		__IOM uint32_t imr_rer_runt : 1;          /*!< [18..18] Interrupt mask of Rx error caused by runt error characterized
                                                   by the frame length in bytes being less than 64 bytes                     */
		__IM  uint32_t            : 1;
		__IOM uint32_t imr_rer_ovf : 1;           /*!< [20..20] Interrupt mask of Rx FIFO overflow                               */
		__IOM uint32_t imr_rdu    : 1;            /*!< [21..21] Interrupt mask of Rx descriptor ring1 is unavailable             */
		__IOM uint32_t imr_tok    : 1;            /*!< [22..22] Interrupt mask of Tx ok                                          */
		__IOM uint32_t imr_ter    : 1;            /*!< [23..23] Interrupt mask of Tx error                                       */
		__IOM uint32_t imr_linkchg : 1;           /*!< [24..24] Interrupt mask of link change                                    */
		__IOM uint32_t imr_tdu    : 1;            /*!< [25..25] Interrupt mask of Tx descriptor ring1 is unavailable             */
		__IOM uint32_t imr_swint  : 1;            /*!< [26..26] Interrupt mask of software interrupt pending                     */
		__IOM uint32_t imr_rdu2   : 1;            /*!< [27..27] Interrupt mask of Rx descriptor ring2 is unavailable             */
		__IOM uint32_t imr_rdu3   : 1;            /*!< [28..28] Interrupt mask of Rx descriptor ring3 is unavailable             */
		__IOM uint32_t imr_rdu4   : 1;            /*!< [29..29] Interrupt mask of Rx descriptor ring4 is unavailable             */
		__IOM uint32_t imr_rdu5   : 1;            /*!< [30..30] Interrupt mask of Rx descriptor ring5 is unavailable             */
		__IOM uint32_t imr_rdu6   : 1;            /*!< [31..31] Interrupt mask of Rx descriptor ring6 is unavailable             */
	} b;                                        /*!< bit fields for ethernet_isr_imr */
} ethernet_isr_imr_t, *pethernet_isr_imr_t;

/**
  \brief Union type to access ethernet_tc (@ 0x00000040).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000040) Transmit Configuration Register                            */

	struct {
		__IOM uint32_t r_tx_nopadding : 1;        /*!< [0..0] 1: HW does not pad short packet (< 60B). 0: HW pads short
                                                   packet to 64B.                                                            */
		__IM  uint32_t            : 7;
		__IOM uint32_t lbk        : 2;            /*!< [9..8] The loopback function must be independent of the link
                                                   state. 2'b00: normal operation 2'b01: Loopback mode_R2T
                                                   (lbkmode_r2t) : 2'b10: Reserved 2'b11: Loopback mode (lbk_mode).          */
		__IOM uint32_t ifg        : 3;            /*!< [12..10] InterFrameGap Time: This field allows the user to adjust
                                                   the interframe gap time longer than the standard: 9.6 us
                                                   for 10Mbps, 960 ns for 100Mbps. The time can be programmed
                                                   from 9.6 us to 14.4 us (10Mbps) and 960ns to 1440ns (100Mbps)             */
	} b;                                        /*!< bit fields for ethernet_tc */
} ethernet_tc_t, *pethernet_tc_t;

/**
  \brief Union type to access ethernet_rc (@ 0x00000044).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000044) Receive Configuration Register                             */

