Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_eth_type.h
	struct {
		__IOM uint32_t data       : 16;           /*!< [15..0] Defines the MII resgister data.                                   */
		__IOM uint32_t regaddr    : 5;            /*!< [20..16] Defines the MII register address.                                */
		__IM  uint32_t            : 1;
		__IOM uint32_t disable_auto_polling : 1;  /*!< [22..22] Disable auto polling feature of mdio operation. 0:
                                                   HW auto polling PCS status. 1: HW does not auto polling
                                                   PCS status.                                                               */
		__IM  uint32_t            : 3;
		__IOM uint32_t phyaddr    : 5;            /*!< [30..26] Defines the Phy address for the MII.                             */
		__IOM uint32_t flag       : 1;            /*!< [31..31] Flag bit, used to identify access to MII register 1:
                                                   Write data to MII register. Turns to 0 automatically upon
                                                   completion of MAC writing to the specified MII register.
                                                   0: Read data from MII register. Turns to 1 automatically
                                                   upon completion of MAC reading the specified MII register.                */
	} b;                                        /*!< bit fields for ethernet_miia */
} ethernet_miia_t, *pethernet_miia_t;

/**
  \brief Union type to access ethernet_vlan (@ 0x00000064).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000064) VLAN Register                                              */

	struct {
		__IM  uint32_t            : 15;
		__IOM uint32_t tdsc_vlan_type : 1;        /*!< [15..15] 1: tx_vlan_action field in the Tx command descriptor
                                                   is for s-tag. 0: tx_vlan_action field in the Tx command
                                                   descriptor is for c-tag.                                                  */
		__IOM uint32_t stag_pid   : 16;           /*!< [31..16] Set the s-tag protocol identifier.                               */
	} b;                                        /*!< bit fields for ethernet_vlan */
} ethernet_vlan_t, *pethernet_vlan_t;

/**
  \brief Union type to access ethernet_txfdp1 (@ 0x00001300).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00001300) Tx 1st Descriptor Ring Address Register                    */

	struct {
		__IOM uint32_t txfdp1     : 32;           /*!< [31..0] Tx 1st priority Descriptor Pointer to the Tx Ring.                */
	} b;                                        /*!< bit fields for ethernet_txfdp1 */
} ethernet_txfdp1_t, *pethernet_txfdp1_t;

/**
  \brief Union type to access ethernet_txcdo1 (@ 0x00001304).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00001304) Tx 1st Current Descriptor Offset Register                  */

	struct {
		__IOM uint32_t txcdo1     : 12;           /*!< [11..0] Tx 1st priority current descriptor offset: FDP+CDO =
                                                   current descriptor pointer. CDO increments by 16 bytes
                                                   each time.                                                                */
	} b;                                        /*!< bit fields for ethernet_txcdo1 */
} ethernet_txcdo1_t, *pethernet_txcdo1_t;

/**
  \brief Union type to access ethernet_rxfdp1 (@ 0x000013F0).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x000013F0) Rx 1st Descriptor Ring Address Register                    */

	struct {
		__IOM uint32_t rxfdp1     : 32;           /*!< [31..0] Rx 1st queue Descriptor Pointer to the Rx Ring.                   */
	} b;                                        /*!< bit fields for ethernet_rxfdp1 */
} ethernet_rxfdp1_t, *pethernet_rxfdp1_t;

/**
  \brief Union type to access ethernet_rxrs1cdo1 (@ 0x000013F4).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x000013F4) Rx 1st Descriptor Ring Size & 1st Current Descriptor
                                                                  Offset Register                                            */

	struct {
		__IOM uint32_t rxringsize_1_h : 4;        /*!< [3..0] This is the bit[11:8] of RxRingSize1.                              */
		__IM  uint32_t            : 4;
		__IOM uint32_t rxringsize_1_l : 8;        /*!< [15..8] This is the total number of descriptors in the Rx descriptor
                                                   rings of 1st queue. (bit[7:0] of RxRingSize1) Act as bit
                                                   mask, eg. RxRingSize [11:0]: 0000_0000_1111: 16 descriptors
                                                   0000_0001_1111: 32 descriptors 0000_0011_1111: 64 descriptors
                                                   0000_0111_1111: 128 descriptors 0000_1111_1111: 256 descriptors
                                                   0001_1111_1111: 512 descriptors 0011_1111_1111: 1024 descriptors
                                                   0111_1111_1111: 2048 descriptors 1111_1111_1111: 4096 descriptors
                                                   Any other value in this register yields undefined results.                */
		__IOM uint32_t rxcdo1     : 12;           /*!< [27..16] Rx Current Descriptor Offset of 1st queue: RxFDP +
                                                   RxCDO = current descriptor pointer. CDO increments by 16
                                                   each time (each increment is one byte).                                   */
	} b;                                        /*!< bit fields for ethernet_rxrs1cdo1 */
} ethernet_rxrs1cdo1_t, *pethernet_rxrs1cdo1_t;

/**
  \brief Union type to access ethernet_rx_pse_des_thres_1_h (@ 0x0000142C).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x0000142C) PHY Mode Clock Phase Control Register                      */

