Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_eth_type.h
	struct {
		__IM  uint32_t            : 5;
		__IOM uint32_t phy_mode_clk_phase_chg : 1;/*!< [5..5] Changes the clock phase in the PHY mode                            */
	} b;                                        /*!< bit fields for ethernet_rx_pse_des_thres_1_h */
} ethernet_rx_pse_des_thres_1_h_t, *pethernet_rx_pse_des_thres_1_h_t;

/**
  \brief Union type to access ethernet_etnrxcpu1 (@ 0x00001430).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00001430) Rx Ring1 Threshold Register                                */

	struct {
		__IOM uint32_t etnrxcpu1  : 32;           /*!< [31..0] Rx ring1 threshold settings                                       */
	} b;                                        /*!< bit fields for ethernet_etnrxcpu1 */
} ethernet_etnrxcpu1_t, *pethernet_etnrxcpu1_t;

/**
  \brief Union type to access ethernet_io_cmd (@ 0x00001434).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00001434) I/O Command Register 0                                     */

	struct {
		__IOM uint32_t txfn1st    : 1;            /*!< [0..0] 1st Priority DMA-Ethernet Transmit enable. 1: Enable.
                                                   0: Disable.                                                               */
		__IOM uint32_t txfn2nd    : 1;            /*!< [1..1] 2nd Priority DMA-Ethernet Transmit enable. 1: Enable.
                                                   0: Disable.                                                               */
		__IOM uint32_t txfn3rd    : 1;            /*!< [2..2] 3rd Priority DMA-Ethernet Transmit enable. 1: Enable.
                                                   0: Disable.                                                               */
		__IOM uint32_t txfn4th    : 1;            /*!< [3..3] 4th Priority DMA-Ethernet Transmit enable. 1: Enable.
                                                   0: Disable.                                                               */
		__IOM uint32_t te         : 1;            /*!< [4..4] Tx Enable                                                          */
		__IOM uint32_t re         : 1;            /*!< [5..5] Rx Enable                                                          */
		__IOM uint32_t reg_int_timer_sel : 2;     /*!< [7..6] RXPktTimer, TXPktTimer Unit (TU)                                   */
		__IOM uint32_t rxintmitigation_l : 3;     /*!< [10..8] This sets the number of packets received before RxOK
                                                   interrupt is triggered. 0000: 1 pkt 0001: 4 pkts 0010:
                                                   8 pkts 0011: 12 pkts 0100: 16 pkts 0101: 20 pkts 0110:
                                                   24 pkts 0111: 28 pkts                                                     */
		__IOM uint32_t rxfth      : 2;            /*!< [12..11] Rx Threshold: Specifies the threshold level in the
                                                   Rx FIFO to begin the transmission. When the byte count
                                                   of the data in the Rx FIFO reaches this level, (or the
                                                   FIFO contains at least one complete packet or the end of
                                                   a packet) the Ethernet module will transmit this packet.
                                                   00: 1024 Bytes. 01: 128 Bytes. 10: 256 Bytes. 11: 512 Bytes.              */
		__IOM uint32_t rxpkttimer_l : 3;          /*!< [15..13] Timer to trigger RxOK interrupt before receipt of RxIntMitigation
                                                   pkts. 0000: no timer set 0001~1111: the timer interval
                                                   defining a multiple of TU Ex: 011 = timer interval set
                                                   to 3 x 4 =12 TU This only applies to packets of size larger
                                                   than 128 bytes. Once RxOK is asserted the timer mechanism
                                                   is reinitialized. For ingress pkt which is short than 128B,
                                                   RxOK interrupt asserts after DMA completes.                               */
		__IOM uint32_t txintmitigation_l : 3;     /*!< [18..16] This sets the number of packets received before TxOK
                                                   interrupt is triggered. 0000: 1 pkt 0001: 4 pkts 0010:
                                                   8 pkts 0011: 12 pkts 0100: 16 pkts 0101: 20 pkts 0110:
                                                   24 pkts 0111: 28 pkts                                                     */
		__IOM uint32_t tsh        : 2;            /*!< [20..19] Tx Threshold: Specifies the threshold level in the
                                                   Tx FIFO to begin the transmission. When the byte count
                                                   of the data in the Tx FIFO reaches this level, (or the
                                                   FIFO contains at least one complete packet or the end of
                                                   a packet) the Ethernet module will transmit this packet.
                                                   00: 128 Bytes. 01: 256 Bytes. 10: 512 Bytes. 11: 1024 Bytes.              */
		__IOM uint32_t rxintmitigation_h : 1;     /*!< [21..21] See bit[19:8]                                                    */
		__IOM uint32_t rxpkttimer_h : 1;          /*!< [22..22] See bit[15:13]                                                   */
		__IOM uint32_t txintmitigation_h : 1;     /*!< [23..23] See bit[18:16]                                                   */
		__IOM uint32_t txpkttimer : 4;            /*!< [27..24] Timer to trigger TxOK interrupt before receipt of TxIntMitigation
                                                   pkts. 0000: no timer set 0001~1111: the timer interval
                                                   defining a multiple of TU Ex: 0011 = timer interval sets
                                                   to 3 x 4 =12 TU Once TxOK is asserted the timer mechanism
                                                   is reinitialized.                                                         */
		__IOM uint32_t en_early_tx : 1;           /*!< [28..28] 0: disable, 1: enable. Disable early tx by GAMC while
                                                   tx command descriptor.IPCS, UDPCS or TCPCS are set to high.               */
		__IOM uint32_t max_dma_sel_h : 1;         /*!< [29..29] See bit[31]                                                      */
		__IOM uint32_t shortdesformat : 1;        /*!< [30..30] Short descriptor format 1: tx/rx descriptor will use
                                                   old format (4 x 32-bit each item) 0: use new format to
                                                   support sram mapping.                                                     */
		__IOM uint32_t max_dma_sel_l : 1;         /*!< [31..31] Select the dma burst size on bus. 00: 16 DW (1DW =
                                                   4 Bytes) 01: 32 DW 10: 64 DW 11: 128DW.                                   */
	} b;                                        /*!< bit fields for ethernet_io_cmd */
} ethernet_io_cmd_t, *pethernet_io_cmd_t;

/**
  \brief Union type to access ethernet_io_cmd1 (@ 0x00001438).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00001438) I/O Command Register 1                                     */

