Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_eth_type.h
	struct {
		__IM  uint32_t            : 8;
		__IOM uint32_t txfn5th    : 1;            /*!< [8..8] 5th Priority DMA-Ethernet Transmit enable. 1: Enable.
                                                   0: Disable.                                                               */
		__IM  uint32_t            : 5;
		__IOM uint32_t Tx_hl_pri_se : 2;          /*!< [15..14] 2'b00: TX ring uses strict priority. 2'b01: TX ring
                                                   uses high and low queue priority. Inside high queue, tx
                                                   ring is round robin. Inside low queue, tx ring is round
                                                   robin. Strict priority is used for high and low queue selection.
                                                   2'b10 and 2'b11: Reserved.                                                */
		__IOM uint32_t rxring1    : 1;            /*!< [16..16] Ethernet-DMA Receive Ring1 enable. 1: Enable. 0: Disable.        */
		__IOM uint32_t rxring2    : 1;            /*!< [17..17] Ethernet-DMA Receive Ring2 enable. 1: Enable. 0: Disable.        */
		__IOM uint32_t rxring3    : 1;            /*!< [18..18] Ethernet-DMA Receive Ring3 enable. 1: Enable. 0: Disable.        */
		__IOM uint32_t rxring4    : 1;            /*!< [19..19] Ethernet-DMA Receive Ring4 enable. 1: Enable. 0: Disable.        */
		__IOM uint32_t rxring5    : 1;            /*!< [20..20] Ethernet-DMA Receive Ring5 enable. 1: Enable. 0: Disable.        */
		__IOM uint32_t rxring6    : 1;            /*!< [21..21] Ethernet-DMA Receive Ring6 enable. 1: Enable. 0: Disable.        */
		__IM  uint32_t            : 2;
		__IOM uint32_t en_1gb     : 1;            /*!< [24..24] 1: support 1GB addressing in lx master bus. 0: Not
                                                   support.                                                                  */
		__IOM uint32_t en_rx_mring : 1;           /*!< [25..25] Enable rx multiple rings. 1: rx using multiple rings.
                                                   max: 6 rings (ring1 to ring6). 0: rx using single ring
                                                   (ring1 only).                                                             */
		__IOM uint32_t rxokint_msk_128b : 1;      /*!< [26..26] 1: For ingress pkt which is short than 128B, RxOK interrupt
                                                   asserts after DMA completes (compatible issue). 0: For
                                                   ingress pkt which is short than 128B, RxOK interrupt does
                                                   not assert after DMA completes.                                           */
		__IOM uint32_t en_precise_dma : 1;        /*!< [27..27] 0: disable precise DMA transfer. 1: enable precise
                                                   DMA transfer.                                                             */
		__IOM uint32_t dsc_format_extra : 3;      /*!< [30..28] Extra descriptor format. SW should set this field before
                                                   set io_cmd.te or io_cmd.re to 1.                                          */
	} b;                                        /*!< bit fields for ethernet_io_cmd1 */
} ethernet_io_cmd1_t, *pethernet_io_cmd1_t;

/** @} */ /* End of group hs_hal_ethernet_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_ETHERNET_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8735B_ETHERNET_TYPE_H_

